HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/smc_gen/r_dtc_rx/src/r_dtc_rx.c
/***********************************************************************************************************************
* Copyright (c) 2014 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/

/*******************************************************************************
* File Name    : r_dtc_rx.c
* Description  : Functions for using DTC on RX devices.
*******************************************************************************/
/*******************************************************************************
* History : DD.MM.YYYY Version Description
*         : 17.03.2014 1.00    Initial revision
*         : 17.07.2014 2.00    Second  revision
*         : 12.11.2014 2.01    Added RX113.
*         : 30.01.2015 2.02    Added RX71M.
*         : 13.04.2015 2.03    Added RX231 and RX230.
*         : 24.12.2015 2.04    Changed Tool-Chain version.
*         :                    Modified #define name from "DTC_CFG_SHORT_ADDRRESS_MODE"
*         :                    to "DTC_CFG_SHORT_ADDRESS_MODE".
*         :                    Added RX130, RX23T and RX24T.
*         : 30.09.2016 2.05    Added RX65N.
*         :                    Supported to the register added in DTCb.
*         :                    Supported sequence transfer.
*         :                    Added R_DTC_CreateSeq() function.
*         :                    Added DTC_CMD_SEQUENCE_TRANSFER_ENABLE,
*         :                    DTC_CMD_SEQUENCE_TRANSFER_DISABLE and DTC_CMD_SEQUENCE_TRANSFER_ABORT
*         :                    to R_DTC_Control().
*         : 31.01.2017 2.06    Added the default setting of "writeback_disable", "sequence_end",
*         :                    "refer_index_table_enable" and "disp_add_enable" in R_DTC_Create()
*         :                    if the DTC IP version is DTCb or later.
*         : 31.03.2017 2.07    Added RX24U and RX24T-512KB.
*         : 31.07.2017 2.08    Supported RX65N-2MB and RX130-512KB.
*         :                    Fixed to correspond to Renesas coding rule.
*         :                    Added DTC_CMD_CHANGING_DATA_FORCIBLY_SET command to R_DTC_Control().
*         : 28.09.2018 2.10    Supported RX66T.
*         :                    Fixed to correspond to Renesas coding rule.
*         :                    Add WAIT_LOOP comments.
*         : 01.02.2019 2.20    Supported RX72T, RX65N-64pin.
*                              Fixed DTC setting procedure.
*         : 28.06.2019 3.10    Added support for RX23W.
*         : 15.08.2019 3.20    Added support for RX72M.
                               Fixed warnings in IAR.
*         : 25.11.2019 3.30    Added support for RX13T.
*         :                    Modified comment of API function to Doxygen style.
*         :                    Fixed to comply with GSCE Coding Standards Rev.6.00.
*         : 30.12.2019 3.40    Added support for RX66N, RX72N.
*         : 31.03.2021 3.70    Added support for RX671.
*         : 15.04.2021 3.80    Added support for RX140.
*         : 27.12.2022 4.21    Updated slash format of included header file paths for Linux compatibility.
*         : 31.03.2023 4.30    Fixed to comply with GSCE Coding Standards Rev.6.5.0.
*         : 29.05.2023 4.40    Fixed warnings in IAR.
*                              Fixed to comply with GSCE Coding Standards Rev.6.5.0.
*         : 15.03.2025 4.51    Updated disclaimer.
*         : 30.10.2025 4.60    Fixed to comply with GSCE Coding Standards Rev.6.6.0.
*******************************************************************************/

/*******************************************************************************
Includes   <System Includes> , "Project Includes"
*******************************************************************************/
/* Defines for DTC support */
#include <stdlib.h>
#include "r_dtc_rx_if.h"
#include "./src/r_dtc_rx_private.h"


/*******************************************************************************
Macro definitions
*******************************************************************************/
#define    DTC_PRV_ACT_BIT_MASK            (0x8000) /* DTC Active flag (DTCSTS.ACT) bit mask */
#define    DTC_PRV_VECT_NR_MASK            (0x00FF) /* DTC-Activating Vector Number bits mask */
#define    DTC_PRV_MAX_16BITS_COUNT_VAL    (65536)  /* The maximum value of 16bit count value */
#define    DTC_PRV_MAX_8BITS_COUNT_VAL     (256)    /* The maximum value of 8bit count value */
#define    DTC_PRV_MIN_COUNT_VAL           (1)      /* The minimum of count value  and block size */
#define    DTC_PRV_ESPSEL_BIT_MASK         (0x8000) /* DTC Sequence transfer vector number setting bit mask */

/*******************************************************************************
Typedef definitions
*******************************************************************************/

/*******************************************************************************
Exported global variables (to be accessed by other files)
*******************************************************************************/
extern const dtc_activation_source_t g_source_array[];
uint32_t                           * gp_dtc_table_work[2];


/*******************************************************************************
Private variables and functions
*******************************************************************************/
static bool s_is_opened = false; /* Indicate whether DTC is opened. */

static dtc_err_t r_dtc_set_transfer_data (dtc_transfer_data_t * p_transfer_data,
                                            dtc_transfer_data_cfg_t * p_cfg);
static void      r_dtc_clear_all_dtce_bits (void);
static bool      r_dtc_abort_chain_transfer (uint32_t chain_transfer_nr);
static bool      r_dtc_acquire_hw_lock (void);
static void      r_dtc_release_hw_lock (void);
static bool      r_dtc_check_dmac_locking_sw (void);
static dtc_err_t r_dtc_check_create_param (dtc_transfer_data_t * p_transfer_data, dtc_transfer_data_cfg_t * p_data_cfg);



