HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/smc_gen/r_dtc_rx/src/r_dtc_rx.c
                /* Restore the DTCE bit. */
                ICU.DTCER[act_source].BIT.DTCE = dtce_backup;
                return DTC_ERR_INVALID_ARG;
            }
            else
            {
                p_data_cfg++;
                p_transfer_data++;
            }
            count--;
        }

        /* Write start address of Transfer data to dtc index table. */
        *p_ptr = (uint32_t)p_transfer_data_backup;
    }

    /* Restore RRS bit. */
    DTC.DTCCR.BIT.RRS = rrs_backup;

    /* Restore the DTCE bit. */
    ICU.DTCER[act_source].BIT.DTCE = dtce_backup;

    return DTC_SUCCESS;
#endif /* (DTC_DISABLE == DTC_CFG_USE_SEQUENCE_TRANSFER) */
}
/* End of function R_DTC_CreateSeq */

/***********************************************************************************************************************
* Function Name: R_DTC_Close
********************************************************************************************************************//**
* @brief This function is used to release the resources of the DTC.
* @retval DTC_SUCCESS Successful operation
* @retval DTC_SUCCESS_DMAC_BUSY Successful operation.One or some DMAC resources are locked.
* @details Unlocks*1 the DTC and disable all DTC activation source by clearing the DTC Activation Enable Register
* DTCERn; stop supplying clock to DTC and put it to Module stop state.If in addition all
* DMAC channels have been unlocked, the function sets the DMAC and DTC to the module stop state.*2\n\n
* Note:\n 1. The DTC FIT module uses the r_bsp default lock function. As a result, the DTC is in the unlocked
* state after a successful end.\n 2. Because a shared bit is used as both the DMAC module stop setting bit and
* the DTC module stop setting bit, the function confirms that all DMAC channels are unlocked before making the
* module stop setting. (For details, see the "Low Power Consumption" section in the User's Manual: Hardware.)\n
* See Section 3 in application note for details.
* @note When controlling the DMAC without using the DMAC FIT module, make sure to monitor the usage of the DMAC and
* control locking and unlocking of the DMAC so that calling this function does not set the DMAC to the module
* stop state. Note that even if the DMAC has not been activated, it is necessary to keep it in the locked state
* when not making DMAC transfer settings.
*/
dtc_err_t R_DTC_Close(void)
{
    /* Clear DTCE bits. */
    r_dtc_clear_all_dtce_bits();

    /* Stop DTC module. */
    DTC.DTCST.BIT.DTCST = 0;

    /* DTC is closed. */
    s_is_opened = false;

    /* Cast type of "gp_dtc_table_work" to match type of parameter in "free" function */
    free((void *)gp_dtc_table_work[1]);
    gp_dtc_table_work[1] = NULL;

    /* Check DMAC locking. */
    if (true == r_dtc_check_dmac_locking_sw())
    {
        /* Disable the power for DTC and DMAC module. */
        r_dtc_module_disable();

        /* Release hardware lock. */
        r_dtc_release_hw_lock();
    }
    else
    {
        /* Release hardware lock. */
        r_dtc_release_hw_lock();
        return DTC_SUCCESS_DMAC_BUSY;
    }

    return DTC_SUCCESS;
}
/* End of function R_DTC_Close */

/***********************************************************************************************************************
* Function Name: R_DTC_Control
********************************************************************************************************************//**
* @brief This function controls the operation of the DTC.
* @param[in] command DTC control command
* @param[in] p_stat Pointer to the status when command is DTC_CMD_STATUS_GET.\n
* See Section 3 in application note for details.
* @param[in] p_args Pointer to the argument structure when command is DTC_CMD_ACT_SRC_ENABLE,DTC_CMD_ACT_SRC_DISABLE,
* DTC_CMD_CHAIN_TRANSFER_ABORT, DTC_CMD_SEQUENCE_TRANSFER_ENABLE, or DTC_CMD_CHANGING_DATA_FORCIBLY_SET.\n
* See Section 3 in application note for details.
* @retval [DTC_SUCCESS] Successful operation
* @retval [DTC_ERR_NOT_OPEN] DTC is not initialized yet.
* @retval [DTC_ERR_INVALID_COMMAND] Command parameters are invalid or DTC_CMD_CHANGING_DATA_FORCIBLY_SET command error.
* @retval [DTC_ERR_NULL_PTR] Argument pointers are NULL.
* @retval [DTC_ERR_ACT] Data transfer is in progress.
* @details Processing is performed depending on the command.\n
* See Section 3 in application note for details.
* @note When the command is DTC_CMD_GET_STATUS, the vector number is valid if only the DTC is in the progress
* (p_stat->in_progress is true). With command DTC_CMD_ENABLE_ACT_SRC, DTC_CMD_DISABLE_ACT_SRC or
* DTC_CMD_SEQUENCE_TRANSFER_ABORT, before calling R_DTC_Control(), user must disable the current interrupt request
* (the interrupt source is passed to R_DTC_Control()) by clearing Interrupt Request Enable bit (IERm.IENj);\n\n
* ICU.IER[m].BIT.IENj = 0;\n\n
* After processing of R_DTC_Control() is ended, the interrupt request disabled is enabled. The correspondence between
* IERm.IENj bit and interrupt source is described in Interrupt Vector Table, chapter Interrupt Controller (ICU) of
* User's Manual: Hardware. With abort processing, user must re-create the Chain transfer data after the transfer is
* aborted because the old Transfer data are destroyed. If an invalid value is attempted to set with
* DTC_CMD_CHANGING_DATA_FORCIBLY_SET, R_DTC_Control() returns DTC_ERR_INVALID_COMMAND R_DTC_Control() may already update
* some registers before the invalid value is detected. This occurs only when users try
* to change FORCIBLY DTC with Invalid Value.
*/
dtc_err_t R_DTC_Control(dtc_command_t command, dtc_stat_t *p_stat, dtc_cmd_arg_t *p_args)
{
    uint32_t              count                   = 0;
    uint32_t            * p_ptr                   = NULL;
    uint8_t               dtce_backup             = 0;
    uint8_t               rrs_backup              = 0;
    dtc_transfer_data_t * p_transfer_data_backup  = NULL;

#if (1 == DTC_CFG_PARAM_CHECKING_ENABLE)

    if ((DTC_CMD_STATUS_GET == command) && (NULL == p_stat))
    {
        return DTC_ERR_NULL_PTR;
    }
    else if ((((DTC_CMD_ACT_SRC_ENABLE == command) || (DTC_CMD_ACT_SRC_DISABLE == command)) ||
            (DTC_CMD_CHAIN_TRANSFER_ABORT == command)) || (DTC_CMD_SEQUENCE_TRANSFER_ENABLE == command))
    {
        if (NULL == p_args) /* Require argument */
        {
            return DTC_ERR_NULL_PTR;
        }
    }
    else if (DTC_CMD_CHANGING_DATA_FORCIBLY_SET == command)
    {
        if (NULL == p_args) /* Require argument */
        {
            return DTC_ERR_INVALID_COMMAND;
        }
        if (r_dtc_check_create_param(p_args->p_transfer_data, p_args->p_data_cfg) != DTC_SUCCESS)
        {
            return DTC_ERR_INVALID_COMMAND;
        }
    }
    else
    {
        /* do nothing */
    }

#endif /* DTC_CFG_PARAM_CHECKING_ENABLE */

