HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/smc_gen/r_dtc_rx/src/r_dtc_rx.c
    if (false == s_is_opened)
    {
        r_dtc_release_hw_lock();
        return DTC_ERR_NOT_OPEN;
    }

    switch (command)
    {
        case DTC_CMD_DTC_START: /* Start DTC module. */
        {
            /* DTC Module start*/
            DTC.DTCST.BIT.DTCST = 1;
            break;
        }

        case DTC_CMD_DTC_STOP: /* Stop DTC module. */
        {
            /* DTC Module stop*/
            DTC.DTCST.BIT.DTCST = 0;
            break;
        }

        case DTC_CMD_DATA_READ_SKIP_ENABLE: /* Enable Transfer Data Read Skip. */
        {
            /* Set Read Skip Enable bit*/
            DTC.DTCCR.BIT.RRS = 1;
            break;
        }

        case DTC_CMD_DATA_READ_SKIP_DISABLE: /* Disable Transfer Data Read Skip. */
        {
            /* Clear Read Skip Enable bit*/
            DTC.DTCCR.BIT.RRS = 0;
            break;
        }

        case DTC_CMD_ACT_SRC_ENABLE: /* Select one interrupt as a DTC activation source. */
        {
            /* Set Activation source for DTC*/
            ICU.DTCER[p_args->act_src].BIT.DTCE = 1;
            break;
        }

        case DTC_CMD_ACT_SRC_DISABLE: /* Remove one interrupt as a DTC activation source. */
        {
            /* Clear Activation source*/
            ICU.DTCER[p_args->act_src].BIT.DTCE = 0;
            break;
        }

        case DTC_CMD_STATUS_GET:
        {
            /* Check DTC Status*/
            if (0 == (DTC.DTCSTS.WORD & DTC_PRV_ACT_BIT_MASK)) /* DTC transfer operation is not in progress. */
            {
                p_stat->in_progress = false;

                /* DTC is not in progress. -> vector number is invalid. */
            }
            else /* DTC transfer operation is in progress. */
            {
                p_stat->in_progress = true;

                /* Get the current vector number. */
                p_stat->vect_nr = (uint8_t)(DTC.DTCSTS.WORD & DTC_PRV_VECT_NR_MASK); /* get lower 8 bits: 0-7*/
            }
            break;
        }

        case DTC_CMD_CHAIN_TRANSFER_ABORT:
        {
            r_dtc_abort_chain_transfer(p_args->chain_transfer_nr);
            break;
        }

#if (DTC_IP_VER_DTCb <= DTC_IP)

        case DTC_CMD_SEQUENCE_TRANSFER_ENABLE:

            /* Set the sequence transfer vector number and sequence transfer is enabled. */
            DTC.DTCSQE.WORD = (DTC_PRV_ESPSEL_BIT_MASK | (uint16_t)p_args->act_src);
            break;

        case DTC_CMD_SEQUENCE_TRANSFER_DISABLE:

            /* Sequence transfer is disabled. */
            DTC.DTCSQE.WORD &= (~DTC_PRV_ESPSEL_BIT_MASK);
            break;

        case DTC_CMD_SEQUENCE_TRANSFER_ABORT:

            /* DTC transfer operation is in progress. */
            if (DTC.DTCSTS.WORD & DTC_PRV_ACT_BIT_MASK)
            {
                /* Store value of VECN of DTCSQE Register to "tmp" variable */
                uint16_t tmp = DTC.DTCSQE.BIT.VECN;

                /* Compare value of VECN of DTCSTS Register with "tmp" variable */
                if (DTC.DTCSTS.BIT.VECN == tmp)
                {
                    return DTC_ERR_ACT;
                }
            }

            /* Abort the sequence transfer. */
            DTC.DTCOR.BIT.SQTFRL = 1;
            break;

#endif /* (DTC_IP_VER_DTCb <= DTC_IP) */

        case DTC_CMD_CHANGING_DATA_FORCIBLY_SET:
        {
            /* Store start address of p_args->p_transfer_data. */
            p_transfer_data_backup = p_args->p_transfer_data;

            /* Store old value of DTCERn.DTCE bit. */
            dtce_backup = ICU.DTCER[p_args->act_src].BIT.DTCE;

            /* Disable the interrupt source. Clear the DTCER */
            ICU.DTCER[p_args->act_src].BIT.DTCE = 0;

            /* Store old value of DTCCR.RRS bit. */
            rrs_backup = DTC.DTCCR.BIT.RRS;

            /* Clear RRS bit. */
            DTC.DTCCR.BIT.RRS = 0;

            count = p_args->chain_transfer_nr + 1;

            /* Apply configurations */
            /* WAIT_LOOP */
            while (count > 0)
            {
                if (r_dtc_set_transfer_data(p_args->p_transfer_data, p_args->p_data_cfg) != DTC_SUCCESS)
                {
                    /* Fail to apply configurations for Transfer data. */
                    /* Restore RRS bit */
                    DTC.DTCCR.BIT.RRS = rrs_backup;

                    /* Restore the DTCE bit. */
                    ICU.DTCER[p_args->act_src].BIT.DTCE = dtce_backup;
                    return DTC_ERR_INVALID_COMMAND;
                }
                else
                {
                    p_args->p_transfer_data++;
                    p_args->p_data_cfg++;
                }
                count--;
            }

            /* The row in Vector table corresponding to act_source */
            p_ptr = (uint32_t *)((uint32_t)DTC.DTCVBR + (4 * p_args->act_src));

            /* Write start address of Transfer data to Vector table. */
            *p_ptr = (uint32_t)p_transfer_data_backup;

            /* Restore RRS bit */
            DTC.DTCCR.BIT.RRS = rrs_backup;

            /* Restore the DTCE bit. */
            ICU.DTCER[p_args->act_src].BIT.DTCE = dtce_backup;
            break;
        }
        default:
        {
            return DTC_ERR_INVALID_COMMAND;
            break;
        }
    }

    return DTC_SUCCESS;
}
/* End of function R_DTC_Control */

/*******************************************************************************
* Function Name: R_DTC_GetVersion
****************************************************************************//**
* @brief This function is used to get the driver version information.
* @return Version_number Upper 2 bytes: major version, lower 2 bytes: minor version
* @details Returns the version information.
* @note None
*/
uint32_t R_DTC_GetVersion(void)
{
    uint32_t version = 0;

    version = (DTC_VERSION_MAJOR << 16) | DTC_VERSION_MINOR;

    return version;
}
/* End of function R_DTC_GetVersion */

/*******************************************************************************
* Function Name: r_dtc_set_transfer_data
* Description  : Applies configurations to a Transfer data area, it is an internal
*                function called by R_DTC_Create(); and all arguments are validated
*                in R_DTC_Create()
* Arguments    : transfer_data -
*                    Start address of Transfer data
*                data_cfg -
*                    Contains configurations for the Transfer data
* Return Value : DTC_SUCCESS -
*                    Apply configurations for Transfer data successfully.
*                DTC_ERR_INVALID_ARG
*                    Fail to apply configurations for Transfer data.
*******************************************************************************/
static dtc_err_t r_dtc_set_transfer_data(dtc_transfer_data_t *p_transfer_data,
                                        dtc_transfer_data_cfg_t *p_cfg)
{
    dtc_mra_t                          t_mra;
    dtc_mrb_t                          t_mrb;
    dtc_cra_t                          t_cra;
    dtc_crb_t                          t_crb;

    /* Cast type of "p_transfer_data" to match type of "p_td_ptr" */
    volatile dtc_internal_registers_t * p_td_ptr = (volatile dtc_internal_registers_t *)p_transfer_data;

    /* Set for MRA - . */
#if (DTC_IP_VER_DTCb <= DTC_IP)
#if (DTC_ENABLE != DTC_CFG_SHORT_ADDRESS_MODE) /* Full-address mode */
    dtc_mrc_t                          t_mrc;

    /* Casting to match type of "t_mrc.BYTE" */
    t_mrc.BYTE = (uint8_t)(p_cfg->disp_add_enable);
#endif /* (DTC_ENABLE == DTC_CFG_SHORT_ADDRESS_MODE) */
    /* Casting to match type of "t_mra.BYTE" */
    t_mra.BYTE = ((((uint8_t)p_cfg->writeback_disable | (uint8_t)p_cfg->src_addr_mode) | (uint8_t)p_cfg->data_size) |
            (uint8_t)p_cfg->transfer_mode);

