HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/smc_gen/r_dtc_rx/src/r_dtc_rx.c
    /* Casting to match type of "t_mrb.BYTE" */
    t_mrb.BYTE = (((((((uint8_t)p_cfg->sequence_end | (uint8_t)p_cfg->refer_index_table_enable) |
            (uint8_t)p_cfg->dest_addr_mode) | (uint8_t)p_cfg->repeat_block_side) | (uint8_t)p_cfg->response_interrupt) |
            (uint8_t)p_cfg->chain_transfer_enable) | (uint8_t)p_cfg->chain_transfer_mode);
#else
    /* Casting to match type of "t_mra.BYTE" */
    t_mra.BYTE = (((uint8_t)p_cfg->src_addr_mode | (uint8_t)p_cfg->data_size) | (uint8_t)p_cfg->transfer_mode);

    /* Casting to match type of "t_mrb.BYTE" */
    t_mrb.BYTE = (((((uint8_t)p_cfg->dest_addr_mode | (uint8_t)p_cfg->repeat_block_side) |
            (uint8_t)p_cfg->response_interrupt) | (uint8_t)p_cfg->chain_transfer_enable) |
            (uint8_t)p_cfg->chain_transfer_mode);
#endif /* (DTC_IP_VER_DTCb <= DTC_IP) */

    switch (t_mra.BIT.MD) /* DTC transfer mode */
    {
        case 0x0: /* Normal mode */
        {
            if (DTC_PRV_MAX_16BITS_COUNT_VAL == p_cfg->transfer_count)/* Transfer count = 65536 */
            {
                t_cra.WORD = 0x0000;
            }
            else /* 1 - 65535 */
            {
                /* Cast type of "p_cfg->transfer_count" to uint16_t to match type of "t_cra.WORD" */
                t_cra.WORD = (uint16_t)p_cfg->transfer_count;
            }
            break;
        }

        case 0x1: /* Repeat mode */
        {
            /* Set counter. */
            if (p_cfg->transfer_count < DTC_PRV_MAX_8BITS_COUNT_VAL) /* count 1-255 */
            {
                /* Cast type of "p_cfg->transfer_count" to match type of "t_cra.BYTE.CRA_H" */
                t_cra.BYTE.CRA_H = (uint8_t)p_cfg->transfer_count;

                /* Cast type of "p_cfg->transfer_count" to match type of "t_cra.BYTE.CRA_L" */
                t_cra.BYTE.CRA_L = (uint8_t)p_cfg->transfer_count;
            }
            else if (DTC_PRV_MAX_8BITS_COUNT_VAL == p_cfg->transfer_count)
            {
                t_cra.BYTE.CRA_H = 0x00;
                t_cra.BYTE.CRA_L = 0x00;
            }
            else /* Transfer count > 256 */
            {
                return DTC_ERR_INVALID_ARG;
            }
            break;
        }

        case 0x2: /* DTC_TRANSFER_MODE_BLOCK - Block transfer mode */
        {
            /* Set counter. */
            if (DTC_PRV_MAX_16BITS_COUNT_VAL == p_cfg->transfer_count)/* Transfer count = 65536 */
            {
                t_crb.WORD = 0x0000;
            }
            else /* 1 - 65535 */
            {
                /* Cast type of "p_cfg->transfer_count" to uint16_t to match type of "t_cra.WORD" */
                t_crb.WORD = (uint16_t)p_cfg->transfer_count;
            }

            if (p_cfg->block_size < DTC_PRV_MAX_8BITS_COUNT_VAL) /* Block size 1-255 */
            {
                /* Cast type of "p_cfg->block_size" to match type of "t_cra.BYTE.CRA_H" */
                t_cra.BYTE.CRA_H = (uint8_t)p_cfg->block_size;

                /* Cast type of "p_cfg->block_size" to match type of "t_cra.BYTE.CRA_L" */
                t_cra.BYTE.CRA_L = (uint8_t)p_cfg->block_size;
            }
            else if (DTC_PRV_MAX_8BITS_COUNT_VAL == p_cfg->block_size) /* Block size = 256 */
            {
                t_cra.BYTE.CRA_H = 0;
                t_cra.BYTE.CRA_L = 0;
            }
            else /* Invalid block size */
            {
                return DTC_ERR_INVALID_ARG;
            }
            break;
        }

        default:
        {
            return DTC_ERR_INVALID_ARG;
            break;
        }
    }

#if (DTC_ENABLE == DTC_CFG_SHORT_ADDRESS_MODE) /* Short-address mode */
    /* settings for fist long word: MRA & SAR */
    p_td_ptr->FIRST_LWORD.LWORD   =  0; /* clear */
    p_td_ptr->FIRST_LWORD.REG.MRA =  t_mra; /* 1 byte MRA */
    p_td_ptr->FIRST_LWORD.LWORD   |= (p_cfg->source_addr & 0x00FFFFFF); /* 3 byte SAR */

    /* settings for second long word: MRB & DAR */
    p_td_ptr->SECOND_LWORD.LWORD   =  0; /* clear */
    p_td_ptr->SECOND_LWORD.REG.MRB =  t_mrb; /* 1 byte MRB */
    p_td_ptr->SECOND_LWORD.LWORD   |= (p_cfg->dest_addr & 0x00FFFFFF); /* 3 byte DAR */

    /* settings for third long word: CRA & CRB */
    p_td_ptr->THIRD_LWORD.REG.CRA.WORD = t_cra.WORD;
    p_td_ptr->THIRD_LWORD.REG.CRB.WORD = t_crb.WORD;

#else /* Full-address mode */
    /* settings for fist long word: MRA & MRB */
    p_td_ptr->FIRST_LWORD.REG.MRA.BYTE = t_mra.BYTE; /* 1 byte MRA */
    p_td_ptr->FIRST_LWORD.REG.MRB.BYTE = t_mrb.BYTE; /* 1 byte MRB */
#if (DTC_IP_VER_DTCb <= DTC_IP)
    p_td_ptr->FIRST_LWORD.REG.MRC.BYTE = t_mrc.BYTE; /* 1 byte MRC */
#endif /* (DTC_IP_VER_DTCb <= DTC_IP) */

    /* settings for second long word: SAR */
    p_td_ptr->SECOND_LWORD.SAR = p_cfg->source_addr; /* 4 byte SAR */

    /* settings for third long word: DAR */
    p_td_ptr->THIRD_LWORD.DAR = p_cfg->dest_addr; /* 4 byte DAR */

    /* settings for fourth long word: CRA & CRB */
    p_td_ptr->FOURTH_LWORD.REG.CRA.WORD = t_cra.WORD;
    p_td_ptr->FOURTH_LWORD.REG.CRB.WORD = t_crb.WORD;
#endif /* (DTC_ENABLE == DTC_CFG_SHORT_ADDRESS_MODE) */
    return DTC_SUCCESS;
}
/* End of function r_dtc_set_transfer_data */

/*******************************************************************************
* Function Name: r_dtc_clear_all_dtce_bits
* Description  : Clears all DTCERn.DTCE bit corresponding to the interrupt that
*                can be selected as DTC activation sources.
* Arguments    : addr -
*                  Address need to be validated
* Return Value : true -
*                  The address is valid.
*                false -
*                  The address is invalid.
*******************************************************************************/
static void r_dtc_clear_all_dtce_bits(void)
{
    volatile uint32_t dtce_cnt = 0;

    /* Clear all DTCER registers.
     * Scan through all available DTCER registers in Array.
     */
    /* WAIT_LOOP */
    while (dtce_cnt < DTC_NUM_INTERRUPT_SRC)
    {
        /* Clear Activation source*/
        ICU.DTCER[g_source_array[dtce_cnt]].BIT.DTCE = 0;
        dtce_cnt++;
    }

    return;
}
/* End of function r_dtc_clear_all_dtce_bits */

